tap "dart-lang/dart"
tap "homebrew/bundle"
tap "homebrew/portable-ruby"
tap "homebrew/services"
tap "leoafarias/fvm"
tap "mongodb/brew"
tap "sidneys/homebrew"
brew "aria2"
brew "cabextract"
brew "cdrtools"
brew "gitlab-runner", restart_service: true
brew "unbound"
brew "gnutls"
brew "openjdk@11"
brew "qemu"
brew "rbenv"
brew "ruby-install"
brew "tcpflow"
brew "tomcat", restart_service: true
brew "wimlib"
brew "leoafarias/fvm/fvm"
brew "mongodb/brew/mongodb-community"
brew "sidneys/homebrew/chntpw"
cask "mongodb-compass"
